template/3D_dampBreak/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;	//This is an scaling operation. Done at the end.

xmin  0;
xmax  3.22;
ymin -0.5;
ymax  0.5;
zmin  0;
zmax  1;

//xcells 20;
//ycells 20;
//zcells 1;

//deltax 0.05;	//0.05
//deltay 0.05;	//0.05
//deltaz 0.05;	//0.05

//lx #calc "$xmax - $xmin";
//ly #calc "$ymax - $ymin";
//lz #calc "$zmax - ($zmin)";

//xcells #calc "round(($lx)/($deltax))";
//ycells #calc "round(($ly)/($deltay))";
//zcells #calc "round(($lz)/($deltaz))";

vertices
(
//BLOCK1
    ($xmin  $ymin  $zmin)	//0
    ($xmax  $ymin  $zmin)	//1
    ($xmax  $ymax  $zmin)	//2
    ($xmin  $ymax  $zmin)	//3
    ($xmin  $ymin  $zmax)	//4
    ($xmax  $ymin  $zmax)	//5
    ($xmax  $ymax  $zmax)	//6
    ($xmin  $ymax  $zmax)	//7

/*
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
*/
);

blocks
(
   // hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (85 30 30) simpleGrading (1 1 1)
);

edges
(

);

boundary
(
    top
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    front
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    back
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
);

mergePatchPairs
(

);

// ************************************************************************* //
